# Задание 2
'''Реализовать класс Road (дорога).
* определить атрибуты: length (длина), width (ширина);
* значения атрибутов должны передаваться при создании экземпляра класса;
* атрибуты сделать защищёнными;
* определить метод calculate расчёта массы асфальта, необходимого для покрытия всей дороги;
* использовать формулу:
  длина * ширина * масса асфальта для покрытия одного кв. метра дороги асфальтом, толщиной в 1 см *
  число см толщины полотна`;
* проверить работу метода.

Например: `20 м * 5000 м * 25 кг * 5 см = 12500 т.`

> Проверьте! Результат должен получаться в тоннах.
'''

class Road:
    def __init__(self, length: int, width: int):
        """конструктор класса
        :param length: длинна в метрах
        :param width: ширина в метрах
        """
        self.__length = length
        self.__width = width

    def calculate(self, height: int = 5, mass_m_2: int = 25) -> int:
        """
        считает масу массу асфальта, необходимого для покрытия всей дороги в тоннах
        :param hight: высота дорожного полотна в сантиметрах
        :param mass_m_2: масса в кг квадратного метра дороги высотой 1 см
        :return: int значение тонн, дробная часть если есть НЕ учитывается
        """
        return int(self.__length * self.__width * mass_m_2 * height / 1000)


if __name__ == '__main__':
    road = Road(5000, 20)
    print(f'Для изготовления покрытия дороги нужно {road.calculate()} тонн.')
